owhinata/stm32f746g-disco/port/ltdc/ltdc_display.c
/*
 * SPDX-License-Identifier: MIT
 * Copyright (c) 2026 ThreadX Shell Project
 */
/**
 * @file    ltdc_display.c
 * @brief   RK043FN48H LCD bring-up via LTDC (issue #52/#53).
 *
 * See ltdc_display.h for the API contract and the clock/memory rationale.
 * Hardware setup, mirroring the ST BSP (stm32746g_discovery_lcd.c) / RM0385:
 *
 *   - Pixel clock from PLLSAI: VCO_in = HSE/M = 25/25 = 1 MHz (M shared with the
 *     main PLL, RM0385 §5.3.8), PLLSAIN=192 -> VCO 192 MHz, PLLSAIR=5 ->
 *     PLLLCDCLK 38.4 MHz, PLLSAIDIVR=8 -> LCD_CLK 4.8 MHz (~29.6 Hz).  PLLSAI is a
 *     separate PLL, so SYSCLK (216 MHz) and the FMC SDRAM clock (108 MHz) are
 *     untouched.  4.8 MHz is LOWERED from the stock 9.6 MHz (only PLLSAIDIVR
 *     doubled 4 -> 8) to cut the LTDC's continuous SDRAM read pressure and the
 *     DCMI DMA FIFO errors it causes during camera preview (#59; measured -51%
 *     preview FE vs no levers).  NOTE: at 4.8 MHz the line period is 566 clk =
 *     118 us, well OUTSIDE the RK043FN48H 55..65 us spec (the 480 active px alone
 *     take 100 us), and ~29.6 Hz is below the panel's ~50 Hz floor -- a deliberate
 *     out-of-spec operating point validated on hardware (stable image, no sync
 *     loss / flicker, LTDC underrun=0); the in-spec fallback is ~8.8 MHz / ~54 Hz
 *     (PLLSAIN=176, R=5, DIVR=4).
 *   - Panel timing (RK043FN48H datasheet / rk043fn48h.h), HW values are the
 *     spec minus one: HSYNC 41, HBP 13, HFP 32, VSYNC 10, VBP 2, VFP 2.
 *     Polarity HS/VS/DE active-low, pixel clock not inverted (LTDC_PCPOLARITY_IPC).
 *   - LTDC pins all AF14 except PG12 (AF9): PE4, PG12, PI9/10/14/15, PJ0..11/13..15,
 *     PK0/1/2/4/5/6/7 (UM1907 / ST BSP).  LCD_DISP (PI12) and LCD_BL_CTRL (PK3)
 *     are plain GPIO outputs driven manually.
 *   - One RGB565 layer covering the full 480x272 window, source = the `.sdram`
 *     frame buffers below (two of them, double-buffered).
 *
 * Drawing is DMA2D-accelerated (#53): the Chrom-ART engine does register-to-
 * memory fills (ltdc_dma2d_fill) and memory-to-memory blits (ltdc_dma2d_blit),
 * polled to completion.  DMA2D, the CPU and the LTDC read DMA all touch the same
 * MPU non-cacheable `.sdram` region, so they are coherent with no cache work.
 *
 * Double buffer + tear-free flip (#53): drawing targets the back buffer;
 * ltdc_flip() stages it via HAL_LTDC_SetAddress_NoReload() then HAL_LTDC_Reload
 * (VERTICAL_BLANKING) and waits for the hardware reload.  SRCR.VBR is the
 * authoritative signal -- it self-clears only after the HW commits the reload at
 * the next vertical blanking (RM0385 §18.7.6) -- and the reload-ready IRQ
 * (LTDC_IRQHandler -> HAL_LTDC_ReloadEventCallback -> ltdc_reload_sem) is just a
 * wake-up hint.  fail-closed: a stuck reload latches ltdc_fault and leaves the
 * front buffer untouched.  ltdc_lock serializes all drawing + flips.  The
 * FIFO-underrun / transfer-error flags are still polled via ltdc_errors().
 *
 * Clean-room implementation; ST BSP / RM0385 §18 used as reference only.
 */
#include "ltdc_display.h"
#include "sdram.h"

#include "stm32f7xx_hal.h"
#include "tx_api.h"

#define LOG_TAG "ltdc"
#include "log.h"

/* Manually-driven panel control pins (UM1907 / ST BSP). */
#define LCD_DISP_PORT     GPIOI
#define LCD_DISP_PIN      GPIO_PIN_12
#define LCD_BL_CTRL_PORT  GPIOK
#define LCD_BL_CTRL_PIN   GPIO_PIN_3

/* RK043FN48H timing (rk043fn48h.h); LTDC programs spec-minus-one. */
#define RK_HSYNC  41u
#define RK_HBP    13u
#define RK_HFP    32u
#define RK_VSYNC  10u
#define RK_VBP     2u
#define RK_VFP     2u

/* Double buffer: two 480 x 272 RGB565 frames = 2 x 261120 B in non-cacheable
   SDRAM.  ltdc_front selects the displayed one; the other is the draw target. */
static uint16_t ltdc_fb[2][LTDC_LCD_WIDTH * LTDC_LCD_HEIGHT]
	__attribute__((aligned(32), section(".sdram")));

static LTDC_HandleTypeDef  hltdc;
static DMA2D_HandleTypeDef hdma2d;

static uint8_t      ltdc_front;       /* index (0/1) of the displayed buffer  */
static bool         ltdc_up;          /* init succeeded                       */
static bool         ltdc_tried;       /* init ran (idempotence latch)         */
static bool         ltdc_fault;       /* reload stuck -> display latched down */
static bool         ltdc_gui_owned;   /* GUIX owns the display (#55)          */
static bool         ltdc_disabled;    /* LTDC scanout stopped (lcd disable, #66) */
static TX_SEMAPHORE ltdc_reload_sem;  /* posted by the reload-ready IRQ       */
static TX_MUTEX     ltdc_lock;        /* serializes drawing + flip            */

bool ltdc_is_up(void)
{
	return ltdc_up && !ltdc_fault;
}

uint16_t *ltdc_framebuffer(void)
{
	return ltdc_is_up() ? &ltdc_fb[ltdc_front][0] : NULL;
}

uint16_t *ltdc_back_buffer(void)
{
	return ltdc_is_up() ? &ltdc_fb[!ltdc_front][0] : NULL;
}

uint8_t ltdc_active_buffer(void)
{
	return ltdc_front;
}

void ltdc_lock_frame(void)
{
	(void)tx_mutex_get(&ltdc_lock, TX_WAIT_FOREVER);
}

void ltdc_unlock_frame(void)
{
	(void)tx_mutex_put(&ltdc_lock);
}

/* GUIX ownership (#55).  Set/clear under ltdc_lock so the flag flip is atomic
   against an in-flight draw helper: take() cannot complete while a helper holds
   the lock mid-draw, and once owned every public draw/flip path (which re-reads
   ltdc_gui_owned under the same lock) becomes a no-op/refusal. */
bool ltdc_gui_take(bool on)
{
	if (!ltdc_up)               /* lock/objects may not exist yet */
		return false;
	ltdc_lock_frame();
	/* Re-check under the lock: fault and the scanout-disabled flag (#66) are
	   both set under ltdc_lock, so the decision cannot race a concurrent flip
	   or lcd disable.  GUIX cannot run/flip with scanout off. */
	if (ltdc_fault || (on && ltdc_disabled)) {
		ltdc_unlock_frame();
		return false;
	}
	ltdc_gui_owned = on;
	ltdc_unlock_frame();
	return true;
}

/* Stop/start LTDC scanout at runtime (#66).  Disabling clears LTDC_GCR.LTDCEN so
   the controller stops fetching the framebuffer from SDRAM (parks the backlight
   off too); enabling restarts it -- the layer/timing registers are untouched, so
   scanout resumes on the current front buffer.  Refused while GUIX owns the
   display (it cannot run without scanout) or while the LTDC is down/faulted.
   While disabled, ltdc_flip()/ltdc_gui_take(true) refuse (no VBR reload would
   come, so a flip would otherwise latch ltdc_fault).  Thread-context only. */
int ltdc_set_scanout(bool on)
{
	if (!ltdc_up)               /* lock/objects may not exist yet */
		return LTDC_ERR_STATE;
	ltdc_lock_frame();
	/* Re-check fault/ownership under the lock (an in-flight flip can fault, or
	   GUIX can take ownership, between the unlocked entry and here). */
	if (ltdc_fault || ltdc_gui_owned) {
		ltdc_unlock_frame();
		return LTDC_ERR_STATE;
	}
	if (on) {
		__HAL_LTDC_ENABLE(&hltdc);
		ltdc_disabled = false;
		ltdc_backlight(true);
	} else {
		__HAL_LTDC_DISABLE(&hltdc);
		ltdc_disabled = true;
		ltdc_backlight(false);
	}
	ltdc_unlock_frame();
	return LTDC_OK;
}

bool ltdc_scanout_off(void)
{
	return ltdc_is_up() && ltdc_disabled;
}

