owhinata/stm32f746g-disco/port/ltdc/ltdc_display.c
bool ltdc_scanout_active(void)
{
	return ltdc_is_up() && !ltdc_disabled;
}

bool ltdc_gui_owns(void)
{
	return ltdc_gui_owned;
}

uint32_t ltdc_pixel_clock_hz(void)
{
	return ltdc_up ? LTDC_PIXEL_CLOCK_HZ : 0u;
}

void ltdc_backlight(bool on)
{
	GPIO_PinState s = on ? GPIO_PIN_SET : GPIO_PIN_RESET;

	HAL_GPIO_WritePin(LCD_DISP_PORT, LCD_DISP_PIN, s);
	HAL_GPIO_WritePin(LCD_BL_CTRL_PORT, LCD_BL_CTRL_PIN, s);
}

uint32_t ltdc_errors(bool clear)
{
	uint32_t mask = 0u;

	if (!ltdc_up)
		return 0u;
	if (__HAL_LTDC_GET_FLAG(&hltdc, LTDC_FLAG_FU))
		mask |= LTDC_ERRFLAG_FIFO_UNDERRUN;
	if (__HAL_LTDC_GET_FLAG(&hltdc, LTDC_FLAG_TE))
		mask |= LTDC_ERRFLAG_TRANSFER_ERROR;
	if (clear) {
		__HAL_LTDC_CLEAR_FLAG(&hltdc, LTDC_FLAG_FU);
		__HAL_LTDC_CLEAR_FLAG(&hltdc, LTDC_FLAG_TE);
	}
	return mask;
}

/* ---- DMA2D (Chrom-ART) draw primitives (ST BSP LL_FillBuffer / -------------
 * LL_ConvertLineToARGB8888 idiom: per-op Init + ConfigLayer + Start + poll). */

/* Expand an RGB565 colour to ARGB8888 (0x00RRGGBB).  R2M fills MUST pass this
   to HAL_DMA2D_Start(): the F7 HAL takes the R2M "color" argument as an
   ARGB8888 value and re-packs it to the output format (stm32f7xx_hal_dma2d.c
   DMA2D_SetConfig, RM0385 §9), so a raw RGB565 word would render as a wrong
   colour.  The 5/6/5 -> 8/8/8 expansion replicates the high bits into the low
   ones, and the HAL truncates straight back to the original 5/6/5. */
static uint32_t rgb565_to_argb8888(uint16_t c)
{
	uint32_t r = (uint32_t)(c >> 11) & 0x1Fu;
	uint32_t g = (uint32_t)(c >> 5) & 0x3Fu;
	uint32_t b = (uint32_t)c & 0x1Fu;

	r = (r << 3) | (r >> 2);          /* 5 -> 8 */
	g = (g << 2) | (g >> 4);          /* 6 -> 8 */
	b = (b << 3) | (b >> 2);          /* 5 -> 8 */
	return (r << 16) | (g << 8) | b;
}

/* Register-to-memory single-colour fill of a w x h RGB565 block, @p line_off
   u16 of padding skipped at each row end (= dst stride - w). */
static void ltdc_dma2d_fill(uint16_t *dst, uint16_t color, uint32_t w,
                            uint32_t h, uint32_t line_off)
{
	if (w == 0u || h == 0u)
		return;       /* a zero-size DMA2D transfer is not meaningful */

	hdma2d.Instance         = DMA2D;
	hdma2d.Init.Mode        = DMA2D_R2M;
	hdma2d.Init.ColorMode   = DMA2D_OUTPUT_RGB565;
	hdma2d.Init.OutputOffset = line_off;

	if (HAL_DMA2D_Init(&hdma2d) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d, 1) == HAL_OK &&
	    HAL_DMA2D_Start(&hdma2d, rgb565_to_argb8888(color),
	                    (uint32_t)(uintptr_t)dst, w, h) == HAL_OK)
		HAL_DMA2D_PollForTransfer(&hdma2d, 30);
}

/* Memory-to-memory copy of a w x h RGB565 block, with separate u16 row offsets
   for destination (@p dst_off) and source (@p src_off). */
static void ltdc_dma2d_blit(uint16_t *dst, const uint16_t *src, uint32_t w,
                            uint32_t h, uint32_t dst_off, uint32_t src_off)
{
	if (w == 0u || h == 0u)
		return;       /* a zero-size DMA2D transfer is not meaningful */

	hdma2d.Instance          = DMA2D;
	hdma2d.Init.Mode         = DMA2D_M2M;
	hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
	hdma2d.Init.OutputOffset = dst_off;

	hdma2d.LayerCfg[1].AlphaMode      = DMA2D_NO_MODIF_ALPHA;
	hdma2d.LayerCfg[1].InputAlpha     = 0xFF;
	hdma2d.LayerCfg[1].InputColorMode = DMA2D_INPUT_RGB565;
	hdma2d.LayerCfg[1].InputOffset    = src_off;

	if (HAL_DMA2D_Init(&hdma2d) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d, 1) == HAL_OK &&
	    HAL_DMA2D_Start(&hdma2d, (uint32_t)(uintptr_t)src,
	                    (uint32_t)(uintptr_t)dst, w, h) == HAL_OK)
		HAL_DMA2D_PollForTransfer(&hdma2d, 30);
}

/* PLLSAI -> LCD_CLK = 4.8 MHz (#59; see file header / RM0385 §5.3.24/25).
   VCO_in 1 MHz * PLLSAIN(192) = 192 MHz (100..432 range) / PLLSAIR(5) = 38.4 MHz
   / PLLSAIDIVR(8) = 4.8 MHz (~29.6 Hz).  Out-of-spec on purpose (validated on
   hardware); in-spec fallback PLLSAIN=176, R=5, DIVR=4 (-> 8.8 MHz / ~54 Hz). */
static int ltdc_clock_init(void)
{
	RCC_PeriphCLKInitTypeDef pclk = {0};

	pclk.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
	pclk.PLLSAI.PLLSAIN       = 192;
	pclk.PLLSAI.PLLSAIR       = 5;
	pclk.PLLSAIDivR           = RCC_PLLSAIDIVR_8;

	if (HAL_RCCEx_PeriphCLKConfig(&pclk) != HAL_OK) {
		LOG_ERR("PLLSAI/LCD clock config failed");
		return LTDC_ERR_HAL;
	}
	return LTDC_OK;
}

static void ltdc_gpio_init(void)
{
	GPIO_InitTypeDef g = {0};

	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOI_CLK_ENABLE();
	__HAL_RCC_GPIOJ_CLK_ENABLE();
	__HAL_RCC_GPIOK_CLK_ENABLE();

	g.Mode  = GPIO_MODE_AF_PP;
	g.Pull  = GPIO_NOPULL;
	g.Speed = GPIO_SPEED_FREQ_HIGH;

	g.Alternate = GPIO_AF14_LTDC;
	g.Pin = GPIO_PIN_4;                                       /* PE4  */
	HAL_GPIO_Init(GPIOE, &g);

	g.Alternate = GPIO_AF9_LTDC;                             /* PG12 is AF9 */
	g.Pin = GPIO_PIN_12;
	HAL_GPIO_Init(GPIOG, &g);

	g.Alternate = GPIO_AF14_LTDC;
	g.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_14 | GPIO_PIN_15;
	HAL_GPIO_Init(GPIOI, &g);

	g.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
	        GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
	        GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 |
	        GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;          /* PJ0..11,13..15 */
	HAL_GPIO_Init(GPIOJ, &g);

	g.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 |
	        GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;             /* PK0,1,2,4,5,6,7 */
	HAL_GPIO_Init(GPIOK, &g);

	/* LCD_DISP / LCD_BL_CTRL: plain outputs, parked off (asserted last). */
	g.Mode      = GPIO_MODE_OUTPUT_PP;
	g.Pull      = GPIO_NOPULL;
	g.Alternate = 0;
	g.Pin = LCD_DISP_PIN;
	HAL_GPIO_Init(LCD_DISP_PORT, &g);
	g.Pin = LCD_BL_CTRL_PIN;
	HAL_GPIO_Init(LCD_BL_CTRL_PORT, &g);
	ltdc_backlight(false);
}

static int ltdc_controller_init(void)
{
	LTDC_LayerCfgTypeDef layer = {0};

	hltdc.Instance = LTDC;

	hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
	hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
	hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
	hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

	hltdc.Init.HorizontalSync     = RK_HSYNC - 1u;                       /* 40  */
	hltdc.Init.VerticalSync       = RK_VSYNC - 1u;                       /* 9   */
	hltdc.Init.AccumulatedHBP     = RK_HSYNC + RK_HBP - 1u;              /* 53  */
	hltdc.Init.AccumulatedVBP     = RK_VSYNC + RK_VBP - 1u;              /* 11  */
	hltdc.Init.AccumulatedActiveW = LTDC_LCD_WIDTH + RK_HSYNC + RK_HBP - 1u;   /* 533 */
	hltdc.Init.AccumulatedActiveH = LTDC_LCD_HEIGHT + RK_VSYNC + RK_VBP - 1u;  /* 283 */
	hltdc.Init.TotalWidth         = LTDC_LCD_WIDTH + RK_HSYNC + RK_HBP + RK_HFP - 1u;   /* 565 */
	hltdc.Init.TotalHeigh         = LTDC_LCD_HEIGHT + RK_VSYNC + RK_VBP + RK_VFP - 1u;  /* 285 */

	hltdc.Init.Backcolor.Red   = 0;
	hltdc.Init.Backcolor.Green = 0;
	hltdc.Init.Backcolor.Blue  = 0;

	if (HAL_LTDC_Init(&hltdc) != HAL_OK) {
		LOG_ERR("HAL_LTDC_Init failed");
		return LTDC_ERR_HAL;
	}

	layer.WindowX0        = 0;
	layer.WindowX1        = LTDC_LCD_WIDTH;
	layer.WindowY0        = 0;
	layer.WindowY1        = LTDC_LCD_HEIGHT;
	layer.PixelFormat     = LTDC_PIXEL_FORMAT_RGB565;
	layer.Alpha           = 255;
	layer.Alpha0          = 0;
	layer.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
	layer.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
	layer.FBStartAdress   = (uint32_t)(uintptr_t)&ltdc_fb[0][0];
	layer.ImageWidth      = LTDC_LCD_WIDTH;
	layer.ImageHeight     = LTDC_LCD_HEIGHT;
	layer.Backcolor.Red   = 0;
	layer.Backcolor.Green = 0;
	layer.Backcolor.Blue  = 0;

	if (HAL_LTDC_ConfigLayer(&hltdc, &layer, 0) != HAL_OK) {
		LOG_ERR("HAL_LTDC_ConfigLayer failed");
		return LTDC_ERR_HAL;
	}
	return LTDC_OK;
}

