owhinata/stm32f746g-disco/port/ltdc/ltdc_display.c
int ltdc_init(void)
{
	int rc;

	if (ltdc_tried)
		return ltdc_up ? LTDC_OK : LTDC_ERR_STATE;
	ltdc_tried = true;

	/* The frame buffer lives in SDRAM; touching it (clear / LTDC CFBAR) with
	   the FMC down would fault.  Bring-up is fail-soft, so guard explicitly. */
	if (!sdram_is_up()) {
		LOG_ERR("SDRAM down -- LTDC not started");
		return LTDC_ERR_STATE;
	}

	/* ThreadX objects for the tear-free flip (the reload-ready IRQ posts the
	   semaphore; the mutex serializes drawing + flip).  Created before the
	   controller comes up so the IRQ has somewhere to post once enabled. */
	if (tx_semaphore_create(&ltdc_reload_sem, "ltdc_rl", 0) != TX_SUCCESS) {
		LOG_ERR("ltdc reload semaphore create failed");
		return LTDC_ERR_STATE;
	}
	if (tx_mutex_create(&ltdc_lock, "ltdc", TX_INHERIT) != TX_SUCCESS) {
		LOG_ERR("ltdc lock create failed");
		tx_semaphore_delete(&ltdc_reload_sem);
		return LTDC_ERR_STATE;
	}

	rc = ltdc_clock_init();
	if (rc != LTDC_OK)
		goto fail_obj;

	__HAL_RCC_LTDC_CLK_ENABLE();
	__HAL_RCC_DMA2D_CLK_ENABLE();    /* Chrom-ART for the draw primitives */
	ltdc_gpio_init();

	/* `.sdram` is NOLOAD (undefined at reset): clear BOTH buffers to black
	   BEFORE the layer is configured and the backlight comes on, so neither a
	   garbage front frame nor a garbage first flip ever shows. */
	for (uint32_t b = 0; b < 2u; b++)
		for (uint32_t i = 0; i < LTDC_LCD_WIDTH * LTDC_LCD_HEIGHT; i++)
			ltdc_fb[b][i] = LTDC_RGB565_BLACK;

	ltdc_front = 0;
	ltdc_fault = false;

	rc = ltdc_controller_init();
	if (rc != LTDC_OK) {
		ltdc_backlight(false);
		(void)HAL_LTDC_DeInit(&hltdc);
		__HAL_RCC_DMA2D_CLK_DISABLE();
		__HAL_RCC_LTDC_CLK_DISABLE();
		goto fail_obj;     /* ltdc_up stays false */
	}

	/* Reload-ready IRQ: below DCMI/DMA2 (8), above SD (6-7) / USART (5).  The
	   handler only fires after HAL_LTDC_Reload() arms LTDC_IT_RR in ltdc_flip. */
	HAL_NVIC_SetPriority(LTDC_IRQn, 9, 0);
	HAL_NVIC_EnableIRQ(LTDC_IRQn);

	ltdc_backlight(true);

	ltdc_up = true;
	LOG_INF("RK043FN48H up: 480x272 RGB565 double-buffered, LCD_CLK 4.8 MHz, "
	        "FB0 @0x%08lx FB1 @0x%08lx",
	        (unsigned long)(uintptr_t)&ltdc_fb[0][0],
	        (unsigned long)(uintptr_t)&ltdc_fb[1][0]);
	return LTDC_OK;

fail_obj:
	tx_mutex_delete(&ltdc_lock);
	tx_semaphore_delete(&ltdc_reload_sem);
	return rc;
}

void ltdc_fill(uint16_t rgb565)
{
	uint16_t *back;

	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back != NULL)
		ltdc_dma2d_fill(back, rgb565, LTDC_LCD_WIDTH, LTDC_LCD_HEIGHT, 0);
	ltdc_unlock_frame();
}

void ltdc_fill_rect(uint16_t x, uint16_t y, uint16_t w, uint16_t h,
                    uint16_t rgb565)
{
	uint16_t *back;
	uint32_t x1, y1;

	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back == NULL || x >= LTDC_LCD_WIDTH || y >= LTDC_LCD_HEIGHT) {
		ltdc_unlock_frame();
		return;
	}
	x1 = (uint32_t)x + w;
	y1 = (uint32_t)y + h;
	if (x1 > LTDC_LCD_WIDTH)
		x1 = LTDC_LCD_WIDTH;
	if (y1 > LTDC_LCD_HEIGHT)
		y1 = LTDC_LCD_HEIGHT;
	w = (uint16_t)(x1 - x);
	h = (uint16_t)(y1 - y);
	ltdc_dma2d_fill(back + (uint32_t)y * LTDC_LCD_WIDTH + x, rgb565, w, h,
	                LTDC_LCD_WIDTH - w);
	ltdc_unlock_frame();
}

void ltdc_blit(const uint16_t *src, uint16_t x, uint16_t y,
               uint16_t w, uint16_t h)
{
	uint16_t *back;
	uint32_t x1, y1;

	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back == NULL || src == NULL || x >= LTDC_LCD_WIDTH ||
	    y >= LTDC_LCD_HEIGHT) {
		ltdc_unlock_frame();
		return;
	}
	x1 = (uint32_t)x + w;
	y1 = (uint32_t)y + h;
	if (x1 > LTDC_LCD_WIDTH)
		x1 = LTDC_LCD_WIDTH;
	if (y1 > LTDC_LCD_HEIGHT)
		y1 = LTDC_LCD_HEIGHT;
	/* src stride stays the full requested w; the clipped width is x1-x. */
	ltdc_dma2d_blit(back + (uint32_t)y * LTDC_LCD_WIDTH + x, src,
	                x1 - x, y1 - y,
	                LTDC_LCD_WIDTH - (x1 - x), w - (x1 - x));
	ltdc_unlock_frame();
}

void ltdc_colorbar(void)
{
	static const uint16_t bars[8] = {
		LTDC_RGB565_WHITE, LTDC_RGB565_YELLOW, LTDC_RGB565_CYAN,
		LTDC_RGB565_GREEN, LTDC_RGB565_MAGENTA, LTDC_RGB565_RED,
		LTDC_RGB565_BLUE, LTDC_RGB565_BLACK,
	};
	uint16_t *back;
	uint32_t bar_w = LTDC_LCD_WIDTH / 8u;   /* 60 */

	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back == NULL) {
		ltdc_unlock_frame();
		return;
	}
	/* One DMA2D R2M fill per bar; the last bar absorbs the remainder so the
	   eight bars cover the full width exactly. */
	for (uint32_t i = 0; i < 8u; i++) {
		uint32_t x0 = i * bar_w;
		uint32_t w  = (i == 7u) ? (LTDC_LCD_WIDTH - x0) : bar_w;

		ltdc_dma2d_fill(back + x0, bars[i], w, LTDC_LCD_HEIGHT,
		                LTDC_LCD_WIDTH - w);
	}
	ltdc_unlock_frame();
}

void ltdc_blit_demo(void)
{
	uint16_t *back;
	uint32_t half = LTDC_LCD_WIDTH / 2u;   /* 240 */

	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back == NULL) {
		ltdc_unlock_frame();
		return;
	}
	/* M2M copy of the left half (src) over the right half (dst), both within
	   the same back buffer.  Each half is `half` px wide but lives in a
	   full-width (W) frame buffer, so both src and dst skip W-half u16 per row
	   (this is exactly the strided case ltdc_blit() cannot express). */
	ltdc_dma2d_blit(back + half, back, half, LTDC_LCD_HEIGHT,
	                LTDC_LCD_WIDTH - half, LTDC_LCD_WIDTH - half);
	ltdc_unlock_frame();
}

void ltdc_gradient(void)
{
	uint16_t *back;

