owhinata/stm32f746g-disco/port/ltdc/ltdc_display.c
	if (!ltdc_is_up())
		return;       /* no-op when down (lock/objects may not exist) */
	ltdc_lock_frame();
	if (ltdc_gui_owned) {        /* GUIX owns the display: shell draw is a no-op */
		ltdc_unlock_frame();
		return;
	}
	back = ltdc_back_buffer();
	if (back == NULL) {
		ltdc_unlock_frame();
		return;
	}
	/* Per-column colour, so the CPU draws this one straight into the
	   non-cacheable back buffer (no DMA2D acceleration possible). */
	for (uint32_t col = 0; col < LTDC_LCD_WIDTH; col++) {
		uint32_t lum = col * 255u / (LTDC_LCD_WIDTH - 1u);
		uint16_t px = (uint16_t)(((lum >> 3) << 11) |   /* R5 */
		                         ((lum >> 2) << 5) |    /* G6 */
		                          (lum >> 3));           /* B5 */
		for (uint32_t row = 0; row < LTDC_LCD_HEIGHT; row++)
			back[row * LTDC_LCD_WIDTH + col] = px;
	}
	ltdc_unlock_frame();
}

/*
 * Tear-free present (see file/header doc).  ltdc_lock is held across the whole
 * sequence; every return path releases it.  SRCR.VBR is authoritative: it is
 * set by HAL_LTDC_Reload(VERTICAL_BLANKING) and self-cleared by hardware only
 * after the register reload commits at the next vertical blanking (RM0385
 * §18.7.6).  The reload-ready IRQ just wakes us; we still poll VBR to confirm.
 */
/* Raw tear-free present; caller MUST hold ltdc_lock.  Shared by the public
   ltdc_flip() (ownership-gated) and the owner-only ltdc_gui_flip(). */
static int ltdc_flip_locked(void)
{
	uint8_t back;
	int rc = LTDC_OK;

	if (!ltdc_up || ltdc_fault)
		return LTDC_ERR_STATE;
	if (ltdc_disabled)
		return LTDC_ERR_STATE;   /* scanout off (#66): no VBR reload would come */

	back = (uint8_t)!ltdc_front;

	/* Drain any stale reload posts from a previous flip so the wait below
	   blocks on THIS reload, not a leftover one. */
	while (tx_semaphore_get(&ltdc_reload_sem, TX_NO_WAIT) == TX_SUCCESS)
		;

	(void)HAL_LTDC_SetAddress_NoReload(&hltdc,
	                                   (uint32_t)(uintptr_t)&ltdc_fb[back][0],
	                                   0);
	(void)HAL_LTDC_Reload(&hltdc, LTDC_RELOAD_VERTICAL_BLANKING);

	/* Wake-up hint (the IRQ posts on reload-ready); the truth is VBR below.
	   A frame is ~33.7 ms (~29.6 Hz @ 4.8 MHz, #59), so 100 ms is still several
	   frames of slack. */
	(void)tx_semaphore_get(&ltdc_reload_sem, 100);

	/* Authoritative confirmation: wait (up to ~100 ms total) for the hardware
	   to actually clear VBR.  Poll at 1 ms (1 tick) intervals. */
	for (uint32_t i = 0; i < 100u; i++) {
		if ((hltdc.Instance->SRCR & LTDC_SRCR_VBR) == 0u)
			break;
		tx_thread_sleep(1);
	}

	if ((hltdc.Instance->SRCR & LTDC_SRCR_VBR) == 0u) {
		ltdc_front = back;            /* swap committed */
	} else {
		/* fail-closed: the reload never landed -- leave the front buffer
		   as-is and latch the display down (recovery is a system reset). */
		ltdc_fault = true;
		LOG_ERR("LTDC reload stuck (VBR), display down");
		rc = LTDC_ERR_HAL;
	}
	return rc;
}

int ltdc_flip(void)
{
	int rc;

	if (!ltdc_is_up())
		return LTDC_ERR_STATE;   /* down: lock/objects may not exist */
	ltdc_lock_frame();
	/* While GUIX owns the display the shell must not move ltdc_front (it would
	   strand GUIX's canvas on the wrong buffer); refuse under the lock. */
	if (ltdc_gui_owned) {
		ltdc_unlock_frame();
		return LTDC_ERR_STATE;
	}
	rc = ltdc_flip_locked();
	ltdc_unlock_frame();
	return rc;
}

int ltdc_gui_flip(void)
{
	int rc;

	if (!ltdc_is_up())
		return LTDC_ERR_STATE;
	ltdc_lock_frame();
	rc = ltdc_flip_locked();
	ltdc_unlock_frame();
	return rc;
}

/* ---- LTDC reload-ready IRQ (only armed transiently by HAL_LTDC_Reload). ----
 * Wrapped in the ThreadX execution-profile enter/exit exactly like the camera /
 * SD drivers' ISRs.  HAL_LTDC_IRQHandler() clears the RR flag, disables the RR
 * interrupt and dispatches HAL_LTDC_ReloadEventCallback() below. */
void LTDC_IRQHandler(void)
{
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_enter(); __set_PRIMASK(pm); }
#endif
	HAL_LTDC_IRQHandler(&hltdc);
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_exit(); __set_PRIMASK(pm); }
#endif
}

/* Reload-ready: wake ltdc_flip() promptly (it still re-checks VBR). */
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc_cb)
{
	if (hltdc_cb == &hltdc)
		(void)tx_semaphore_put(&ltdc_reload_sem);
}
